:PROPERTIES:
:ID:       62040c0e-a0ca-4f42-a6ef-a9eb992ae15c
:END:
#+title: Emacs-Lisp

- Lisp stands for LISt Processing.
- The programming language handles lists (and lists of lists) by putting them between parentheses. The parentheses mark the boundaries of the list.
- Sometimes a list is preceded by an apostrophe.
- List is made of atoms/elements and also can be list of lists.

#+begin_src emacs-lisp
'(atom1
  atom2
  atom3)
#+end_src

** Functions
#+begin_src emacs-lisp :tangle yes
(defun func1 (arg1 arg2)
  (+ arg1 arg2))

(func1 1 4)
#+end_src

#+RESULTS:
: 5

#+begin_src emacs-lisp
(funcall 'func1 1 6)
#+end_src

#+RESULTS:
: 7
